pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                     File 'pic18_include_grammar.cpp'                      *
//                        Generated by version 2.5.4                         *
//                    december 26th, 2013, at 12h37'13"                      *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

//---------------------------------------------------------------------------*

#include "utilities/MF_MemoryControl.h"
#include "galgas2/C_galgas_CLI_Options.h"

#include "files/C_FileManager.h"

//---------------------------------------------------------------------------*

#include "pic18_include_grammar.h"

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

//---------------------------------------------------------------------------*
//                                                                           *
//                  N O N    T E R M I N A L    N A M E S                    *
//                                                                           *
//---------------------------------------------------------------------------*

static const char * gNonTerminalNames [90] = {
  "<configuration_definition>",// Index 0
  "<ram_definition>",// Index 1
  "<constant_definition>",// Index 2
  "<immediate_expression>",// Index 3
  "<register_parsing>",// Index 4
  "<optional_w_as_dest>",// Index 5
  "<bit_number_parsing>",// Index 6
  "<body>",// Index 7
  "<checkpic_definition>",// Index 8
  "<data_definition>",// Index 9
  "<instruction_list>",// Index 10
  "<interrupt_definition>",// Index 11
  "<routine_definition>",// Index 12
  "<condition_factor>",// Index 13
  "<condition_expression>",// Index 14
  "<condition_term>",// Index 15
  "<block_termination>",// Index 16
  "<structured_instruction>",// Index 17
  "<structured_if_instruction>",// Index 18
  "<simple_instruction>",// Index 19
  "<declaration_in_ram>",// Index 20
  "<immediate_bitwise_term>",// Index 21
  "<immediate_bitwise_factor>",// Index 22
  "<immediate_term>",// Index 23
  "<immediate_factor>",// Index 24
  "<immediate_primary>",// Index 25
  "<select_pic_31__38__5F_syntax_0>",// Index 26
  "<select_pic_31__38__5F_syntax_1>",// Index 27
  "<select_pic_31__38__5F_syntax_2>",// Index 28
  "<select_pic_31__38__5F_syntax_3>",// Index 29
  "<select_pic_31__38__5F_syntax_4>",// Index 30
  "<select_pic_31__38__5F_syntax_5>",// Index 31
  "<select_pic_31__38__5F_syntax_6>",// Index 32
  "<select_pic_31__38__5F_syntax_7>",// Index 33
  "<select_pic_31__38__5F_syntax_8>",// Index 34
  "<select_pic_31__38__5F_syntax_9>",// Index 35
  "<select_pic_31__38__5F_syntax_10>",// Index 36
  "<select_pic_31__38__5F_syntax_11>",// Index 37
  "<select_pic_31__38__5F_syntax_12>",// Index 38
  "<select_pic_31__38__5F_syntax_13>",// Index 39
  "<select_pic_31__38__5F_syntax_14>",// Index 40
  "<select_pic_31__38__5F_syntax_15>",// Index 41
  "<select_pic_31__38__5F_syntax_16>",// Index 42
  "<select_pic_31__38__5F_syntax_17>",// Index 43
  "<select_pic_31__38__5F_syntax_18>",// Index 44
  "<select_pic_31__38__5F_syntax_19>",// Index 45
  "<select_pic_31__38__5F_syntax_20>",// Index 46
  "<select_pic_31__38__5F_syntax_21>",// Index 47
  "<select_pic_31__38__5F_syntax_22>",// Index 48
  "<select_pic_31__38__5F_syntax_23>",// Index 49
  "<select_pic_31__38__5F_syntax_24>",// Index 50
  "<select_pic_31__38__5F_syntax_25>",// Index 51
  "<select_pic_31__38__5F_syntax_26>",// Index 52
  "<select_pic_31__38__5F_syntax_27>",// Index 53
  "<select_pic_31__38__5F_syntax_28>",// Index 54
  "<select_pic_31__38__5F_syntax_29>",// Index 55
  "<select_pic_31__38__5F_syntax_30>",// Index 56
  "<select_pic_31__38__5F_syntax_31>",// Index 57
  "<select_pic_31__38__5F_syntax_32>",// Index 58
  "<select_pic_31__38__5F_syntax_33>",// Index 59
  "<select_pic_31__38__5F_syntax_34>",// Index 60
  "<select_pic_31__38__5F_syntax_35>",// Index 61
  "<select_pic_31__38__5F_syntax_36>",// Index 62
  "<select_pic_31__38__5F_syntax_37>",// Index 63
  "<select_pic_31__38__5F_syntax_38>",// Index 64
  "<select_pic_31__38__5F_syntax_39>",// Index 65
  "<select_pic_31__38__5F_syntax_40>",// Index 66
  "<select_pic_31__38__5F_syntax_41>",// Index 67
  "<select_pic_31__38__5F_syntax_42>",// Index 68
  "<select_communs_0>",// Index 69
  "<select_communs_1>",// Index 70
  "<select_communs_2>",// Index 71
  "<select_communs_3>",// Index 72
  "<select_communs_4>",// Index 73
  "<select_communs_5>",// Index 74
  "<select_communs_6>",// Index 75
  "<select_communs_7>",// Index 76
  "<select_communs_8>",// Index 77
  "<select_communs_9>",// Index 78
  "<select_communs_10>",// Index 79
  "<select_communs_11>",// Index 80
  "<select_communs_12>",// Index 81
  "<select_communs_13>",// Index 82
  "<select_communs_14>",// Index 83
  "<select_communs_15>",// Index 84
  "<select_communs_16>",// Index 85
  "<select_communs_17>",// Index 86
  "<select_communs_18>",// Index 87
  "<select_communs_19>",// Index 88
  "<>"// Index 89
} ;

//---------------------------------------------------------------------------*
//                                                                           *
//           S L R    A N A L Y Z E R    A C T I O N    T A B L E            *
//                                                                           *
//---------------------------------------------------------------------------*

// Action tables handle shift and reduce actions ;
//  - a shift action is (terminal_symbol, SHIFT (n)) : if shifts to state n ;
//  - the accept action is (terminal_symbol, ACCEPT) ;
//  - a reduce action is (terminal_symbol, REDUCE (n)) ; if reduces to state n.

#define SHIFT(a) ((a) + 2)
#define REDUCE(a) (-(a) - 1)
#define ACCEPT (1)
#define END (-1)

