pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
static const PMSInt16 gActionTable [] = {
// State S0 (index = 0)
  C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S1 (index = 27)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (22)
, END
// State S2 (index = 30)
, C_Lexique_piccolo_5F_lexique::kToken_byte, SHIFT (23)
, C_Lexique_piccolo_5F_lexique::kToken_routine, SHIFT (24)
, END
// State S3 (index = 35)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (25)
, END
// State S4 (index = 38)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (26)
, END
// State S5 (index = 41)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (27)
, END
// State S6 (index = 44)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (28)
, END
// State S7 (index = 47)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (29)
, END
// State S8 (index = 50)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (60)
, END
// State S9 (index = 53)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (30)
, END
// State S10 (index = 56)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (31)
, END
// State S11 (index = 59)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (32)
, END
// State S12 (index = 62)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S13 (index = 89)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S14 (index = 116)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S15 (index = 143)
, C_Lexique_piccolo_5F_lexique::kToken_, ACCEPT
, END
// State S16 (index = 146)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S17 (index = 173)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S18 (index = 200)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S19 (index = 227)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S20 (index = 254)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (0)
, END
// State S21 (index = 257)
, C_Lexique_piccolo_5F_lexique::kToken_routine, SHIFT (40)
, END
// State S22 (index = 260)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S23 (index = 287)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (42)
, END
// State S24 (index = 290)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (43)
, END
// State S25 (index = 293)
, C_Lexique_piccolo_5F_lexique::kToken_mark, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_unused, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken__2C_, SHIFT (44)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_inline, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_include, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_data, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_ram, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_const, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (48)
, END
// State S26 (index = 322)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S27 (index = 349)
, C_Lexique_piccolo_5F_lexique::kToken_mark, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_unused, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken__2C_, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_inline, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_include, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_data, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_ram, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_const, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (50)
, END
// State S28 (index = 378)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (49)
, END
// State S29 (index = 381)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, REDUCE (57)
, C_Lexique_piccolo_5F_lexique::kToken_fast, SHIFT (50)
, END
// State S30 (index = 386)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (52)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (213)
, END
// State S31 (index = 391)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (54)
, END
// State S32 (index = 394)
, C_Lexique_piccolo_5F_lexique::kToken__3D_, SHIFT (55)
, END
// State S33 (index = 397)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (36)
, END
// State S34 (index = 400)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (37)
, END
// State S35 (index = 403)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (38)
, END
// State S36 (index = 406)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (42)
, END
// State S37 (index = 409)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (41)
, END
// State S38 (index = 412)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (39)
, END
// State S39 (index = 415)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (40)
, END
// State S40 (index = 418)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (56)
, END
// State S41 (index = 421)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (32)
, END
// State S42 (index = 424)
, C_Lexique_piccolo_5F_lexique::kToken_mark, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_unused, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken__2C_, SHIFT (57)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_inline, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_include, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_data, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_ram, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_const, REDUCE (44)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (44)
, END
// State S43 (index = 453)
, C_Lexique_piccolo_5F_lexique::kToken_mark, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_unused, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken__2C_, SHIFT (59)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_inline, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_include, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_data, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_ram, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_const, REDUCE (46)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (46)
, END
// State S44 (index = 482)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (61)
, END
// State S45 (index = 485)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S46 (index = 512)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (43)
, END
// State S47 (index = 515)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_string, SHIFT (63)
, END
// State S48 (index = 518)
, C_Lexique_piccolo_5F_lexique::kToken_mark, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_inline, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_include, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_data, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_ram, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_const, REDUCE (1)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (1)
, END
// State S49 (index = 545)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (64)
, C_Lexique_piccolo_5F_lexique::kToken_integer, SHIFT (65)
, C_Lexique_piccolo_5F_lexique::kToken__28_, SHIFT (66)
, C_Lexique_piccolo_5F_lexique::kToken__2D_, SHIFT (67)
, C_Lexique_piccolo_5F_lexique::kToken__7E_, SHIFT (68)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_char, SHIFT (69)
, C_Lexique_piccolo_5F_lexique::kToken__40_, SHIFT (70)
, END
// State S50 (index = 560)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, REDUCE (58)
, END
// State S51 (index = 563)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, SHIFT (78)
, END
// State S52 (index = 566)
, C_Lexique_piccolo_5F_lexique::kToken__3A_, SHIFT (79)
, END
// State S53 (index = 569)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, SHIFT (80)
, END
// State S54 (index = 572)
, C_Lexique_piccolo_5F_lexique::kToken_byte, SHIFT (81)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (229)
, END
// State S55 (index = 577)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (64)
, C_Lexique_piccolo_5F_lexique::kToken_integer, SHIFT (65)
, C_Lexique_piccolo_5F_lexique::kToken__28_, SHIFT (66)
, C_Lexique_piccolo_5F_lexique::kToken__2D_, SHIFT (67)
, C_Lexique_piccolo_5F_lexique::kToken__7E_, SHIFT (68)
, C_Lexique_piccolo_5F_lexique::kToken_literal_5F_char, SHIFT (69)
, C_Lexique_piccolo_5F_lexique::kToken__40_, SHIFT (70)
, END
// State S56 (index = 592)
, C_Lexique_piccolo_5F_lexique::kToken__7B_, REDUCE (61)
, C_Lexique_piccolo_5F_lexique::kToken_bank, SHIFT (85)
, END
// State S57 (index = 597)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (87)
, END
// State S58 (index = 600)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S59 (index = 627)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (89)
, END
// State S60 (index = 630)
, C_Lexique_piccolo_5F_lexique::kToken_mark, SHIFT (1)
, C_Lexique_piccolo_5F_lexique::kToken_unused, SHIFT (2)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (59)
, C_Lexique_piccolo_5F_lexique::kToken_inline, SHIFT (3)
, C_Lexique_piccolo_5F_lexique::kToken_include, SHIFT (4)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, SHIFT (5)
, C_Lexique_piccolo_5F_lexique::kToken_data, SHIFT (6)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, SHIFT (7)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, SHIFT (8)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, SHIFT (9)
, C_Lexique_piccolo_5F_lexique::kToken_ram, SHIFT (10)
, C_Lexique_piccolo_5F_lexique::kToken_const, SHIFT (11)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (31)
, END
// State S61 (index = 657)
, C_Lexique_piccolo_5F_lexique::kToken_mark, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_unused, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken__2C_, SHIFT (44)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_inline, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_include, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_data, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_ram, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_const, REDUCE (48)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (48)
, END
// State S62 (index = 686)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (35)
, END
// State S63 (index = 689)
, C_Lexique_piccolo_5F_lexique::kToken_mark, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_unused, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken__2C_, SHIFT (47)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_inline, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_include, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_data, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_configuration, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_ram, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_const, REDUCE (50)
, C_Lexique_piccolo_5F_lexique::kToken_, REDUCE (50)
, END
// State S64 (index = 718)
, C_Lexique_piccolo_5F_lexique::kToken_mark, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_unused, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__2C_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_routine, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_inline, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_include, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_checkpic, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_data, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_interrupt, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_noreturn, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_incf, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_decf, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__21__3D_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__3D__3D_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__3C__3D_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__3E__3D_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__3C_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__3E_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__7C_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__29_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__26_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__2D_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_block, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_do, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_checkbank, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_checknobank, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_ldataptr, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__5B_, SHIFT (93)
, C_Lexique_piccolo_5F_lexique::kToken__5D_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_ltblptr, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_banksel, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken__2A_, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_nobank, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_banksave, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_computed, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_bra, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_goto, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_rcall, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_forever, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_if, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_while, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_mnop, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_bc, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_bnc, REDUCE (259)
, C_Lexique_piccolo_5F_lexique::kToken_bn, REDUCE (259)
