pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
, C_Lexique_piccolo_5F_lexique::kToken_clrwdt, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_daw, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_nop, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_pop, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_push, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_reset, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_sleep, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_addlw, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_andlw, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_iorlw, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_movlw, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_mullw, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_sublw, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_xorlw, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_lfsr, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_tblrd, REDUCE (89)
, C_Lexique_piccolo_5F_lexique::kToken_tblwt, REDUCE (89)
, END
// State S503 (index = 26991)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (479)
, C_Lexique_piccolo_5F_lexique::kToken__28_, SHIFT (252)
, C_Lexique_piccolo_5F_lexique::kToken__2D_, SHIFT (480)
, END
// State S504 (index = 26998)
, C_Lexique_piccolo_5F_lexique::kToken__7D_, SHIFT (506)
, END
// State S505 (index = 27001)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, REDUCE (13)
, C_Lexique_piccolo_5F_lexique::kToken__3A_, REDUCE (13)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (13)
, END
// State S506 (index = 27008)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (479)
, C_Lexique_piccolo_5F_lexique::kToken__28_, SHIFT (252)
, C_Lexique_piccolo_5F_lexique::kToken__2D_, SHIFT (480)
, END
// State S507 (index = 27015)
, C_Lexique_piccolo_5F_lexique::kToken_identifier, SHIFT (491)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (112)
, END
// State S508 (index = 27020)
, C_Lexique_piccolo_5F_lexique::kToken_end, REDUCE (113)
, END} ;

static const PMUInt32 gActionTableIndex [509] = {
  0  // S0
, 27  // S1
, 30  // S2
, 35  // S3
, 38  // S4
, 41  // S5
, 44  // S6
, 47  // S7
, 50  // S8
, 53  // S9
, 56  // S10
, 59  // S11
, 62  // S12
, 89  // S13
, 116  // S14
, 143  // S15
, 146  // S16
, 173  // S17
, 200  // S18
, 227  // S19
, 254  // S20
, 257  // S21
, 260  // S22
, 287  // S23
, 290  // S24
, 293  // S25
, 322  // S26
, 349  // S27
, 378  // S28
, 381  // S29
, 386  // S30
, 391  // S31
, 394  // S32
, 397  // S33
, 400  // S34
, 403  // S35
, 406  // S36
, 409  // S37
, 412  // S38
, 415  // S39
, 418  // S40
, 421  // S41
, 424  // S42
, 453  // S43
, 482  // S44
, 485  // S45
, 512  // S46
, 515  // S47
, 518  // S48
, 545  // S49
, 560  // S50
, 563  // S51
, 566  // S52
, 569  // S53
, 572  // S54
, 577  // S55
, 592  // S56
, 597  // S57
, 600  // S58
, 627  // S59
, 630  // S60
, 657  // S61
, 686  // S62
, 689  // S63
, 718  // S64
, 935  // S65
, 1150  // S66
, 1165  // S67
, 1180  // S68
, 1195  // S69
, 1410  // S70
, 1413  // S71
, 1418  // S72
, 1605  // S73
, 1794  // S74
, 1995  // S75
, 2204  // S76
, 2419  // S77
, 2634  // S78
, 2785  // S79
, 2790  // S80
, 2817  // S81
, 2820  // S82
, 2825  // S83
, 2828  // S84
, 2855  // S85
, 2858  // S86
, 2861  // S87
, 2890  // S88
, 2893  // S89
, 2922  // S90
, 2925  // S91
, 2952  // S92
, 2979  // S93
, 2982  // S94
, 3197  // S95
, 3200  // S96
, 3415  // S97
, 3630  // S98
, 3633  // S99
, 3648  // S100
, 3651  // S101
, 3666  // S102
, 3681  // S103
, 3864  // S104
, 3879  // S105
, 4066  // S106
, 4081  // S107
, 4096  // S108
, 4111  // S109
, 4126  // S110
, 4141  // S111
, 4156  // S112
, 4345  // S113
, 4360  // S114
, 4375  // S115
, 4390  // S116
, 4405  // S117
, 4606  // S118
, 4621  // S119
, 4636  // S120
, 4651  // S121
, 4860  // S122
, 4863  // S123
, 4866  // S124
, 4869  // S125
, 5022  // S126
, 5025  // S127
, 5176  // S128
, 5179  // S129
, 5194  // S130
, 5199  // S131
, 5350  // S132
, 5353  // S133
, 5356  // S134
, 5359  // S135
, 5362  // S136
, 5365  // S137
, 5516  // S138
, 5527  // S139
, 5530  // S140
, 5533  // S141
, 5536  // S142
, 5539  // S143
, 5542  // S144
, 5545  // S145
, 5548  // S146
, 5551  // S147
, 5554  // S148
, 5557  // S149
, 5560  // S150
, 5563  // S151
, 5566  // S152
, 5569  // S153
, 5572  // S154
, 5575  // S155
, 5578  // S156
, 5581  // S157
, 5584  // S158
, 5587  // S159
, 5590  // S160
, 5593  // S161
, 5596  // S162
, 5599  // S163
, 5602  // S164
, 5605  // S165
, 5608  // S166
, 5611  // S167
, 5614  // S168
, 5617  // S169
, 5620  // S170
, 5623  // S171
, 5626  // S172
, 5629  // S173
, 5632  // S174
, 5635  // S175
, 5786  // S176
, 5937  // S177
, 6088  // S178
, 6239  // S179
, 6390  // S180
, 6541  // S181
, 6692  // S182
, 6707  // S183
, 6722  // S184
, 6737  // S185
, 6752  // S186
, 6767  // S187
, 6782  // S188
, 6797  // S189
, 6800  // S190
, 6809  // S191
, 6818  // S192
, 6821  // S193
, 6972  // S194
, 7123  // S195
, 7134  // S196
, 7285  // S197
, 7288  // S198
, 7439  // S199
, 7442  // S200
, 7445  // S201
, 7448  // S202
, 7463  // S203
, 7468  // S204
, 7473  // S205
, 7478  // S206
, 7487  // S207
, 7490  // S208
, 7517  // S209
, 7524  // S210
, 7675  // S211
, 7702  // S212
, 7729  // S213
, 7732  // S214
, 7947  // S215
, 7950  // S216
, 7955  // S217
, 7982  // S218
, 8169  // S219
, 8356  // S220
, 8545  // S221
, 8734  // S222
, 8923  // S223
, 9112  // S224
, 9301  // S225
, 9490  // S226
, 9679  // S227
, 9888  // S228
, 10097  // S229
, 10306  // S230
, 10515  // S231
, 10730  // S232
, 10945  // S233
, 11160  // S234
, 11163  // S235
, 11178  // S236
, 11181  // S237
, 11332  // S238
, 11335  // S239
, 11486  // S240
, 11657  // S241
, 11810  // S242
, 11963  // S243
, 12114  // S244
, 12129  // S245
, 12280  // S246
, 12431  // S247
, 12582  // S248
, 12585  // S249
, 12588  // S250
, 12591  // S251
, 12594  // S252
, 12605  // S253
, 12616  // S254
, 12767  // S255
, 12770  // S256
, 12773  // S257
, 12776  // S258
, 12927  // S259
, 13080  // S260
, 13083  // S261
, 13234  // S262
, 13385  // S263
, 13388  // S264
, 13539  // S265
, 13690  // S266
, 13841  // S267
, 13992  // S268
, 14143  // S269
, 14294  // S270
, 14445  // S271
, 14596  // S272
, 14747  // S273
, 14898  // S274
, 14925  // S275
, 14936  // S276
, 14947  // S277
, 15098  // S278
, 15251  // S279
, 15402  // S280
, 15405  // S281
, 15556  // S282
, 15559  // S283
, 15562  // S284
, 15569  // S285
, 15572  // S286
, 15575  // S287
, 15578  // S288
, 15581  // S289
, 15584  // S290
, 15799  // S291
, 15802  // S292
, 15805  // S293
, 15988  // S294
, 16171  // S295
, 16358  // S296
, 16559  // S297
, 16760  // S298
, 16961  // S299
, 17162  // S300
, 17371  // S301
, 17580  // S302
, 17789  // S303
, 17792  // S304
, 17795  // S305
, 17798  // S306
, 17801  // S307
, 17804  // S308
, 17973  // S309
, 17976  // S310
, 18127  // S311
, 18130  // S312
, 18281  // S313
, 18284  // S314
, 18287  // S315
, 18438  // S316
, 18441  // S317
, 18618  // S318
, 18629  // S319
, 18632  // S320
, 18635  // S321
, 18652  // S322
, 18659  // S323
, 18666  // S324
, 18671  // S325
, 18678  // S326
, 18681  // S327
, 18684  // S328
, 18687  // S329
, 18690  // S330
, 18693  // S331
, 18698  // S332
, 18701  // S333
, 18708  // S334
, 18859  // S335
, 18952  // S336
, 18957  // S337
, 19108  // S338
, 19111  // S339
, 19126  // S340
, 19129  // S341
, 19280  // S342
, 19431  // S343
, 19436  // S344
, 19439  // S345
, 19444  // S346
, 19449  // S347
, 19454  // S348
, 19457  // S349
, 19484  // S350
, 19499  // S351
, 19502  // S352
, 19653  // S353
, 19804  // S354
, 19807  // S355
, 19810  // S356
, 19961  // S357
, 20112  // S358
, 20263  // S359
, 20272  // S360
, 20277  // S361
, 20284  // S362
, 20291  // S363
, 20294  // S364
, 20297  // S365
, 20300  // S366
, 20303  // S367
, 20306  // S368
, 20309  // S369
, 20314  // S370
, 20321  // S371
, 20332  // S372
, 20337  // S373
, 20348  // S374
, 20351  // S375
, 20356  // S376
, 20359  // S377
, 20362  // S378
, 20365  // S379
, 20528  // S380
, 20689  // S381
, 20694  // S382
, 20787  // S383
, 20790  // S384
, 20941  // S385
, 20944  // S386
, 21095  // S387
, 21098  // S388
, 21101  // S389
, 21252  // S390
, 21403  // S391
, 21554  // S392
, 21705  // S393
, 21712  // S394
, 21721  // S395
, 21726  // S396
, 21731  // S397
, 21734  // S398
, 21737  // S399
, 21742  // S400
, 21893  // S401
, 21896  // S402
, 21901  // S403
, 22052  // S404
, 22221  // S405
, 22236  // S406
, 22239  // S407
, 22242  // S408
, 22245  // S409
, 22396  // S410
, 22399  // S411
, 22406  // S412
, 22413  // S413
, 22420  // S414
, 22427  // S415
, 22434  // S416
, 22441  // S417
, 22450  // S418
, 22457  // S419
, 22462  // S420
, 22619  // S421
, 22622  // S422
, 22625  // S423
, 22628  // S424
, 22789  // S425
, 22792  // S426
, 22795  // S427
, 22946  // S428
, 22949  // S429
, 22952  // S430
, 22955  // S431
, 22958  // S432
, 22961  // S433
, 22968  // S434
, 22973  // S435
, 22976  // S436
, 22979  // S437
, 22982  // S438
, 22985  // S439
, 22988  // S440
, 23139  // S441
, 23142  // S442
, 23145  // S443
, 23298  // S444
, 23451  // S445
, 23604  // S446
, 23757  // S447
, 23764  // S448
, 23771  // S449
, 23776  // S450
, 23779  // S451
, 23782  // S452
, 23789  // S453
, 23792  // S454
, 23885  // S455
, 23888  // S456
, 23891  // S457
, 23896  // S458
, 23901  // S459
, 23906  // S460
, 23909  // S461
, 24124  // S462
, 24131  // S463
, 24282  // S464
, 24433  // S465
, 24448  // S466
, 24599  // S467
, 24602  // S468
, 24753  // S469
, 24756  // S470
, 24907  // S471
, 24910  // S472
, 25061  // S473
, 25222  // S474
, 25373  // S475
, 25380  // S476
, 25389  // S477
, 25392  // S478
, 25407  // S479
, 25414  // S480
, 25421  // S481
, 25424  // S482
, 25429  // S483
, 25434  // S484
, 25587  // S485
, 25740  // S486
, 25893  // S487
, 26046  // S488
, 26053  // S489
, 26058  // S490
, 26065  // S491
, 26068  // S492
, 26071  // S493
, 26074  // S494
, 26225  // S495
, 26376  // S496
, 26527  // S497
, 26678  // S498
, 26683  // S499
, 26686  // S500
, 26689  // S501
, 26840  // S502
, 26991  // S503
, 26998  // S504
, 27001  // S505
, 27008  // S506
, 27015  // S507
, 27020  // S508
} ;

//---------------------------------------------------------------------------*
//                                                                           *
//                       SLR states successors table                         *
//                                                                           *
//---------------------------------------------------------------------------*

// Successor tables handle non terminal successors ;
// an entry is (non_terminal_symbol, n) ; successor is state n.

static const PMSInt16 gSuccessorTable0 [21] = {0, 12,
  1, 13,
  2, 14,
  7, 15,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 20,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable12 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 33,
  34, 21, -1} ;

