pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
static const PMSInt16 gSuccessorTable13 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 34,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable14 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 35,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable16 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 36,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable17 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 37,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable18 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 38,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable19 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 39,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable22 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 41,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable25 [3] = {29, 45, -1} ;

static const PMSInt16 gSuccessorTable26 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 46,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable27 [3] = {30, 48, -1} ;

static const PMSInt16 gSuccessorTable29 [3] = {33, 51, -1} ;

static const PMSInt16 gSuccessorTable30 [3] = {69, 53, -1} ;

static const PMSInt16 gSuccessorTable42 [3] = {27, 58, -1} ;

static const PMSInt16 gSuccessorTable43 [3] = {28, 60, -1} ;

static const PMSInt16 gSuccessorTable45 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 62,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable49 [15] = {3, 71,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable54 [5] = {20, 82,
  77, 83, -1} ;

static const PMSInt16 gSuccessorTable55 [15] = {3, 84,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable56 [3] = {35, 86, -1} ;

static const PMSInt16 gSuccessorTable58 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 88,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable60 [19] = {0, 12,
  1, 13,
  2, 14,
  8, 16,
  9, 17,
  11, 18,
  12, 19,
  26, 90,
  34, 21, -1} ;

static const PMSInt16 gSuccessorTable61 [3] = {29, 91, -1} ;

static const PMSInt16 gSuccessorTable63 [3] = {30, 92, -1} ;

static const PMSInt16 gSuccessorTable64 [3] = {84, 94, -1} ;

static const PMSInt16 gSuccessorTable66 [15] = {3, 95,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable67 [5] = {25, 96,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable68 [5] = {25, 97,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable71 [3] = {31, 100, -1} ;

static const PMSInt16 gSuccessorTable72 [3] = {78, 103, -1} ;

static const PMSInt16 gSuccessorTable73 [3] = {79, 105, -1} ;

static const PMSInt16 gSuccessorTable74 [3] = {80, 112, -1} ;

static const PMSInt16 gSuccessorTable75 [3] = {81, 117, -1} ;

static const PMSInt16 gSuccessorTable76 [3] = {82, 121, -1} ;

static const PMSInt16 gSuccessorTable78 [23] = {10, 192,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable79 [3] = {70, 205, -1} ;

static const PMSInt16 gSuccessorTable82 [5] = {20, 82,
  77, 207, -1} ;

static const PMSInt16 gSuccessorTable87 [3] = {27, 211, -1} ;

static const PMSInt16 gSuccessorTable89 [3] = {28, 212, -1} ;

static const PMSInt16 gSuccessorTable99 [15] = {3, 216,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable101 [13] = {21, 218,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable102 [13] = {21, 219,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable104 [11] = {22, 220,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable106 [9] = {23, 221,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable107 [9] = {23, 222,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable108 [9] = {23, 223,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable109 [9] = {23, 224,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable110 [9] = {23, 225,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable111 [9] = {23, 226,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable113 [7] = {24, 227,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable114 [7] = {24, 228,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable115 [7] = {24, 229,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable116 [7] = {24, 230,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable118 [5] = {25, 231,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable119 [5] = {25, 232,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable120 [5] = {25, 233,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable125 [23] = {10, 236,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable129 [15] = {3, 239,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable130 [3] = {4, 242, -1} ;

static const PMSInt16 gSuccessorTable132 [3] = {4, 243, -1} ;

static const PMSInt16 gSuccessorTable137 [23] = {10, 248,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable138 [11] = {4, 253,
  14, 254,
  18, 255,
  55, 256,
  57, 257, -1} ;

static const PMSInt16 gSuccessorTable169 [3] = {4, 260, -1} ;

static const PMSInt16 gSuccessorTable190 [3] = {67, 268, -1} ;

static const PMSInt16 gSuccessorTable191 [3] = {68, 273, -1} ;

static const PMSInt16 gSuccessorTable193 [21] = {17, 193,
  19, 194,
  32, 275,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable194 [21] = {17, 193,
  19, 194,
  32, 276,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable199 [3] = {4, 278, -1} ;

static const PMSInt16 gSuccessorTable200 [3] = {4, 279, -1} ;

static const PMSInt16 gSuccessorTable201 [3] = {4, 280, -1} ;

