pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
static const PMSInt16 gSuccessorTable202 [15] = {3, 281,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable205 [3] = {69, 282, -1} ;

static const PMSInt16 gSuccessorTable206 [3] = {71, 284, -1} ;

static const PMSInt16 gSuccessorTable209 [3] = {36, 288, -1} ;

static const PMSInt16 gSuccessorTable210 [23] = {10, 289,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable216 [3] = {31, 292, -1} ;

static const PMSInt16 gSuccessorTable218 [3] = {78, 293, -1} ;

static const PMSInt16 gSuccessorTable219 [3] = {78, 294, -1} ;

static const PMSInt16 gSuccessorTable220 [3] = {79, 295, -1} ;

static const PMSInt16 gSuccessorTable227 [3] = {81, 296, -1} ;

static const PMSInt16 gSuccessorTable228 [3] = {81, 297, -1} ;

static const PMSInt16 gSuccessorTable229 [3] = {81, 298, -1} ;

static const PMSInt16 gSuccessorTable230 [3] = {81, 299, -1} ;

static const PMSInt16 gSuccessorTable231 [3] = {82, 300, -1} ;

static const PMSInt16 gSuccessorTable232 [3] = {82, 301, -1} ;

static const PMSInt16 gSuccessorTable233 [3] = {82, 302, -1} ;

static const PMSInt16 gSuccessorTable235 [15] = {3, 304,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable240 [3] = {86, 308, -1} ;

static const PMSInt16 gSuccessorTable241 [3] = {47, 310, -1} ;

static const PMSInt16 gSuccessorTable242 [3] = {48, 312, -1} ;

static const PMSInt16 gSuccessorTable243 [23] = {10, 313,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable244 [15] = {3, 314,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable249 [3] = {4, 316, -1} ;

static const PMSInt16 gSuccessorTable252 [13] = {4, 321,
  13, 322,
  14, 323,
  15, 324,
  38, 325,
  39, 326, -1} ;

static const PMSInt16 gSuccessorTable253 [3] = {54, 332, -1} ;

static const PMSInt16 gSuccessorTable254 [23] = {10, 333,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable257 [3] = {4, 336, -1} ;

static const PMSInt16 gSuccessorTable278 [5] = {5, 341,
  88, 342, -1} ;

static const PMSInt16 gSuccessorTable284 [3] = {72, 346, -1} ;

static const PMSInt16 gSuccessorTable305 [3] = {14, 353, -1} ;

static const PMSInt16 gSuccessorTable317 [3] = {86, 308, -1} ;

static const PMSInt16 gSuccessorTable318 [11] = {4, 321,
  13, 361,
  14, 323,
  38, 325,
  39, 326, -1} ;

static const PMSInt16 gSuccessorTable321 [3] = {41, 370, -1} ;

static const PMSInt16 gSuccessorTable322 [3] = {44, 372, -1} ;

static const PMSInt16 gSuccessorTable324 [3] = {43, 374, -1} ;

static const PMSInt16 gSuccessorTable326 [3] = {4, 375, -1} ;

static const PMSInt16 gSuccessorTable331 [3] = {6, 381, -1} ;

static const PMSInt16 gSuccessorTable333 [3] = {61, 385, -1} ;

static const PMSInt16 gSuccessorTable335 [13] = {19, 386,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable336 [3] = {58, 388, -1} ;

static const PMSInt16 gSuccessorTable338 [3] = {4, 389, -1} ;

static const PMSInt16 gSuccessorTable339 [15] = {3, 390,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable343 [3] = {6, 392, -1} ;

static const PMSInt16 gSuccessorTable345 [3] = {74, 396, -1} ;

static const PMSInt16 gSuccessorTable347 [3] = {37, 398, -1} ;

static const PMSInt16 gSuccessorTable350 [15] = {3, 399,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable352 [23] = {10, 401,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable353 [23] = {10, 402,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable359 [3] = {49, 409, -1} ;

static const PMSInt16 gSuccessorTable360 [3] = {6, 410, -1} ;

static const PMSInt16 gSuccessorTable369 [3] = {6, 417, -1} ;

static const PMSInt16 gSuccessorTable371 [11] = {4, 321,
  13, 418,
  14, 323,
  38, 325,
  39, 326, -1} ;

static const PMSInt16 gSuccessorTable373 [13] = {4, 321,
  13, 322,
  14, 323,
  15, 419,
  38, 325,
  39, 326, -1} ;

static const PMSInt16 gSuccessorTable375 [3] = {40, 422, -1} ;

static const PMSInt16 gSuccessorTable379 [3] = {87, 424, -1} ;

static const PMSInt16 gSuccessorTable381 [3] = {56, 426, -1} ;

static const PMSInt16 gSuccessorTable382 [13] = {19, 427,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable383 [5] = {14, 254,
  18, 428, -1} ;

static const PMSInt16 gSuccessorTable384 [23] = {10, 429,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable394 [3] = {76, 433, -1} ;

static const PMSInt16 gSuccessorTable396 [3] = {73, 435, -1} ;

static const PMSInt16 gSuccessorTable399 [3] = {85, 438, -1} ;

static const PMSInt16 gSuccessorTable400 [23] = {10, 439,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable402 [3] = {59, 442, -1} ;

static const PMSInt16 gSuccessorTable405 [15] = {3, 443,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable417 [3] = {42, 448, -1} ;

static const PMSInt16 gSuccessorTable418 [3] = {44, 449, -1} ;

static const PMSInt16 gSuccessorTable419 [3] = {43, 450, -1} ;

static const PMSInt16 gSuccessorTable433 [3] = {75, 457, -1} ;

static const PMSInt16 gSuccessorTable434 [3] = {74, 458, -1} ;

static const PMSInt16 gSuccessorTable441 [3] = {14, 463, -1} ;

static const PMSInt16 gSuccessorTable443 [3] = {50, 466, -1} ;

static const PMSInt16 gSuccessorTable444 [3] = {51, 468, -1} ;

static const PMSInt16 gSuccessorTable445 [3] = {52, 470, -1} ;

static const PMSInt16 gSuccessorTable446 [3] = {53, 472, -1} ;

static const PMSInt16 gSuccessorTable454 [13] = {19, 474,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

