pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
static const PMSInt16 gSuccessorTable458 [3] = {73, 477, -1} ;

static const PMSInt16 gSuccessorTable462 [5] = {14, 481,
  16, 482, -1} ;

static const PMSInt16 gSuccessorTable463 [23] = {10, 483,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable465 [15] = {3, 484,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable476 [3] = {76, 488, -1} ;

static const PMSInt16 gSuccessorTable478 [15] = {3, 489,
  21, 72,
  22, 73,
  23, 74,
  24, 75,
  25, 76,
  83, 77, -1} ;

static const PMSInt16 gSuccessorTable482 [3] = {46, 492, -1} ;

static const PMSInt16 gSuccessorTable483 [3] = {59, 493, -1} ;

static const PMSInt16 gSuccessorTable484 [3] = {50, 494, -1} ;

static const PMSInt16 gSuccessorTable485 [3] = {51, 495, -1} ;

static const PMSInt16 gSuccessorTable486 [3] = {52, 496, -1} ;

static const PMSInt16 gSuccessorTable487 [3] = {53, 497, -1} ;

static const PMSInt16 gSuccessorTable488 [3] = {75, 498, -1} ;

static const PMSInt16 gSuccessorTable489 [3] = {85, 499, -1} ;

static const PMSInt16 gSuccessorTable490 [5] = {14, 481,
  16, 500, -1} ;

static const PMSInt16 gSuccessorTable501 [23] = {10, 504,
  17, 193,
  19, 194,
  32, 195,
  45, 196,
  60, 197,
  62, 198,
  63, 199,
  64, 200,
  65, 201,
  66, 202, -1} ;

static const PMSInt16 gSuccessorTable503 [5] = {14, 481,
  16, 505, -1} ;

static const PMSInt16 gSuccessorTable506 [5] = {14, 481,
  16, 507, -1} ;

static const PMSInt16 gSuccessorTable507 [3] = {46, 508, -1} ;

static const PMSInt16 * gSuccessorTable [509] = {
gSuccessorTable0, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable12, gSuccessorTable13, gSuccessorTable14, NULL, 
  gSuccessorTable16, gSuccessorTable17, gSuccessorTable18, gSuccessorTable19, 
  NULL, NULL, gSuccessorTable22, NULL, 
  NULL, gSuccessorTable25, gSuccessorTable26, gSuccessorTable27, 
  NULL, gSuccessorTable29, gSuccessorTable30, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable42, gSuccessorTable43, 
  NULL, gSuccessorTable45, NULL, NULL, 
  NULL, gSuccessorTable49, NULL, NULL, 
  NULL, NULL, gSuccessorTable54, gSuccessorTable55, 
  gSuccessorTable56, NULL, gSuccessorTable58, NULL, 
  gSuccessorTable60, gSuccessorTable61, NULL, gSuccessorTable63, 
  gSuccessorTable64, NULL, gSuccessorTable66, gSuccessorTable67, 
  gSuccessorTable68, NULL, NULL, gSuccessorTable71, 
  gSuccessorTable72, gSuccessorTable73, gSuccessorTable74, gSuccessorTable75, 
  gSuccessorTable76, NULL, gSuccessorTable78, gSuccessorTable79, 
  NULL, NULL, gSuccessorTable82, NULL, 
  NULL, NULL, NULL, gSuccessorTable87, 
  NULL, gSuccessorTable89, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable99, 
  NULL, gSuccessorTable101, gSuccessorTable102, NULL, 
  gSuccessorTable104, NULL, gSuccessorTable106, gSuccessorTable107, 
  gSuccessorTable108, gSuccessorTable109, gSuccessorTable110, gSuccessorTable111, 
  NULL, gSuccessorTable113, gSuccessorTable114, gSuccessorTable115, 
  gSuccessorTable116, NULL, gSuccessorTable118, gSuccessorTable119, 
  gSuccessorTable120, NULL, NULL, NULL, 
  NULL, gSuccessorTable125, NULL, NULL, 
  NULL, gSuccessorTable129, gSuccessorTable130, NULL, 
  gSuccessorTable132, NULL, NULL, NULL, 
  NULL, gSuccessorTable137, gSuccessorTable138, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable169, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable190, gSuccessorTable191, 
  NULL, gSuccessorTable193, gSuccessorTable194, NULL, 
  NULL, NULL, NULL, gSuccessorTable199, 
  gSuccessorTable200, gSuccessorTable201, gSuccessorTable202, NULL, 
  NULL, gSuccessorTable205, gSuccessorTable206, NULL, 
  NULL, gSuccessorTable209, gSuccessorTable210, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable216, NULL, gSuccessorTable218, gSuccessorTable219, 
  gSuccessorTable220, NULL, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable227, 
  gSuccessorTable228, gSuccessorTable229, gSuccessorTable230, gSuccessorTable231, 
  gSuccessorTable232, gSuccessorTable233, NULL, gSuccessorTable235, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable240, gSuccessorTable241, gSuccessorTable242, gSuccessorTable243, 
  gSuccessorTable244, NULL, NULL, NULL, 
  NULL, gSuccessorTable249, NULL, NULL, 
  gSuccessorTable252, gSuccessorTable253, gSuccessorTable254, NULL, 
  NULL, gSuccessorTable257, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable278, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable284, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable305, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable317, gSuccessorTable318, NULL, 
  NULL, gSuccessorTable321, gSuccessorTable322, NULL, 
  gSuccessorTable324, NULL, gSuccessorTable326, NULL, 
  NULL, NULL, NULL, gSuccessorTable331, 
  NULL, gSuccessorTable333, NULL, gSuccessorTable335, 
  gSuccessorTable336, NULL, gSuccessorTable338, gSuccessorTable339, 
  NULL, NULL, NULL, gSuccessorTable343, 
  NULL, gSuccessorTable345, NULL, gSuccessorTable347, 
  NULL, NULL, gSuccessorTable350, NULL, 
  gSuccessorTable352, gSuccessorTable353, NULL, NULL, 
  NULL, NULL, NULL, gSuccessorTable359, 
  gSuccessorTable360, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable369, NULL, gSuccessorTable371, 
  NULL, gSuccessorTable373, NULL, gSuccessorTable375, 
  NULL, NULL, NULL, gSuccessorTable379, 
  NULL, gSuccessorTable381, gSuccessorTable382, gSuccessorTable383, 
  gSuccessorTable384, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable394, NULL, 
  gSuccessorTable396, NULL, NULL, gSuccessorTable399, 
  gSuccessorTable400, NULL, gSuccessorTable402, NULL, 
  NULL, gSuccessorTable405, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable417, gSuccessorTable418, gSuccessorTable419, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable433, gSuccessorTable434, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable441, NULL, gSuccessorTable443, 
  gSuccessorTable444, gSuccessorTable445, gSuccessorTable446, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, gSuccessorTable454, NULL, 
  NULL, NULL, gSuccessorTable458, NULL, 
  NULL, NULL, gSuccessorTable462, gSuccessorTable463, 
  NULL, gSuccessorTable465, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  gSuccessorTable476, NULL, gSuccessorTable478, NULL, 
  NULL, NULL, gSuccessorTable482, gSuccessorTable483, 
  gSuccessorTable484, gSuccessorTable485, gSuccessorTable486, gSuccessorTable487, 
  gSuccessorTable488, gSuccessorTable489, gSuccessorTable490, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, NULL, NULL, NULL, 
  NULL, gSuccessorTable501, NULL, gSuccessorTable503, 
  NULL, NULL, gSuccessorTable506, gSuccessorTable507, 
  NULL} ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Production rules infos (left non terminal, size of right string)      *
//                                                                           *
//---------------------------------------------------------------------------*

