pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
static const PMSInt16 gProductionsTable [270 * 2] = {
  7, 1,
  8, 3,
  9, 6,
  10, 1,
  11, 6,
  12, 7,
  13, 2,
  13, 1,
  13, 1,
  14, 4,
  15, 2,
  16, 1,
  16, 1,
  16, 5,
  17, 1,
  18, 3,
  19, 1,
  0, 4,
  20, 4,
  1, 5,
  2, 4,
  3, 2,
  21, 2,
  22, 2,
  23, 2,
  24, 2,
  25, 1,
  4, 2,
  6, 2,
  6, 1,
  5, 1,
  26, 0,
  26, 3,
  26, 5,
  26, 5,
  26, 4,
  26, 2,
  26, 2,
  26, 2,
  26, 2,
  26, 2,
  26, 2,
  26, 2,
  26, 3,
  27, 0,
  27, 3,
  28, 0,
  28, 3,
  29, 0,
  29, 3,
  30, 0,
  30, 3,
  31, 0,
  31, 3,
  32, 0,
  32, 2,
  32, 2,
  33, 0,
  33, 1,
  34, 0,
  34, 1,
  35, 0,
  35, 3,
  36, 1,
  36, 3,
  36, 2,
  37, 0,
  37, 2,
  38, 4,
  38, 2,
  38, 4,
  38, 2,
  38, 1,
  39, 1,
  39, 1,
  40, 0,
  40, 2,
  41, 2,
  41, 2,
  41, 2,
  41, 2,
  41, 2,
  41, 2,
  42, 0,
  42, 1,
  43, 0,
  43, 3,
  44, 0,
  44, 3,
  45, 10,
  45, 6,
  45, 2,
  45, 1,
  45, 5,
  45, 2,
  45, 3,
  45, 3,
  45, 1,
  45, 4,
  45, 5,
  45, 3,
  45, 5,
  45, 4,
  45, 7,
  45, 3,
  45, 7,
  45, 2,
  45, 2,
  45, 3,
  45, 2,
  45, 2,
  45, 2,
  46, 0,
  46, 6,
  47, 0,
  47, 2,
  48, 0,
  48, 2,
  49, 3,
  49, 3,
  49, 3,
  49, 3,
  50, 0,
  50, 3,
  51, 0,
  51, 3,
  52, 0,
  52, 3,
  53, 0,
  53, 3,
  54, 2,
  54, 2,
  54, 2,
  54, 1,
  55, 4,
  55, 4,
  56, 0,
  56, 1,
  57, 1,
  57, 1,
  58, 0,
  58, 2,
  59, 0,
  59, 4,
  60, 1,
  60, 1,
  60, 1,
  60, 1,
  60, 1,
  60, 1,
  60, 1,
  60, 1,
  61, 0,
  61, 2,
  61, 2,
  62, 3,
  62, 2,
  62, 4,
  62, 4,
  62, 2,
  62, 2,
  62, 2,
  62, 1,
  62, 1,
  62, 1,
  62, 1,
  62, 1,
  62, 1,
  62, 1,
  62, 2,
  62, 4,
  62, 2,
  62, 2,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  63, 1,
  64, 1,
  64, 1,
  64, 1,
  64, 1,
  64, 1,
  65, 1,
  65, 1,
  65, 1,
  66, 1,
  66, 1,
  66, 1,
  66, 1,
  66, 1,
  66, 1,
  66, 1,
  67, 1,
  67, 1,
  67, 1,
  67, 1,
  68, 1,
  68, 1,
  68, 1,
  68, 1,
  69, 0,
  69, 4,
  70, 1,
  70, 1,
  71, 0,
  71, 3,
  72, 0,
  72, 4,
  73, 0,
  73, 3,
  74, 3,
  74, 1,
  75, 0,
  75, 4,
  76, 0,
  76, 3,
  77, 0,
  77, 2,
  78, 0,
  78, 3,
  78, 3,
  79, 0,
  79, 3,
  80, 0,
  80, 2,
  80, 2,
  80, 2,
  80, 2,
  80, 2,
  80, 2,
  81, 0,
  81, 3,
  81, 3,
  81, 3,
  81, 3,
  82, 0,
  82, 3,
  82, 3,
  82, 3,
  83, 2,
  83, 2,
  83, 1,
  83, 1,
  83, 2,
  83, 3,
  83, 8,
  84, 0,
  84, 3,
  85, 0,
  85, 5,
  86, 0,
  86, 3,
  87, 0,
  87, 3,
  88, 0,
  88, 2,
  89, 1
} ;

//---------------------------------------------------------------------------*
//                                                                           *
//          'configuration_definition' non terminal implementation           *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_configuration_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 17 :
      rule_communs_configuration_5F_definition_i0_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_configuration_5F_definition_ (GALGAS_configDefinitionList &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 17 :
      rule_communs_configuration_5F_definition_i0_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//               'ram_definition' non terminal implementation                *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_ram_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 19 :
      rule_communs_ram_5F_definition_i2_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_ram_5F_definition_ (GALGAS_ramDefinitionList &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 19 :
      rule_communs_ram_5F_definition_i2_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//            'constant_definition' non terminal implementation              *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_constant_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 20 :
      rule_communs_constant_5F_definition_i3_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_constant_5F_definition_ (GALGAS_constantDefinitionList &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 20 :
      rule_communs_constant_5F_definition_i3_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//            'immediate_expression' non terminal implementation             *
//                                                                           *
//---------------------------------------------------------------------------*

