pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
void cGrammar_pic_31__38__5F_include_5F_grammar::nt_immediate_5F_expression_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 21 :
      rule_communs_immediate_5F_expression_i4_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_immediate_5F_expression_ (GALGAS_immediatExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 21 :
      rule_communs_immediate_5F_expression_i4_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'register_parsing' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_register_5F_parsing_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 27 :
      rule_communs_register_5F_parsing_i10_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_register_5F_parsing_ (GALGAS_registerExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 27 :
      rule_communs_register_5F_parsing_i10_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'optional_w_as_dest' non terminal implementation              *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_optional_5F_w_5F_as_5F_dest_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 30 :
      rule_communs_optional_5F_w_5F_as_5F_dest_i13_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_optional_5F_w_5F_as_5F_dest_ (GALGAS_bool &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 30 :
      rule_communs_optional_5F_w_5F_as_5F_dest_i13_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'bit_number_parsing' non terminal implementation              *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_bit_5F_number_5F_parsing_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 28 :
      rule_communs_bit_5F_number_5F_parsing_i11_parse(inLexique) ;
    break ;
  case 29 :
      rule_communs_bit_5F_number_5F_parsing_i12_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_bit_5F_number_5F_parsing_ (GALGAS_bitNumberExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 28 :
      rule_communs_bit_5F_number_5F_parsing_i11_(parameter_1, inLexique) ;
    break ;
  case 29 :
      rule_communs_bit_5F_number_5F_parsing_i12_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//                    'body' non terminal implementation                     *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_body_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 0 :
      rule_pic_31__38__5F_syntax_body_i0_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_body_ (GALGAS_pic_31__38_InterruptDefinitionList &  parameter_1,
                                GALGAS_pic_31__38_RoutineDefinitionList &  parameter_2,
                                GALGAS_lstringlist &  parameter_3,
                                GALGAS_lstringlist &  parameter_4,
                                GALGAS_ramDefinitionList &  parameter_5,
                                GALGAS_lstringlist &  parameter_6,
                                GALGAS_configDefinitionList &  parameter_7,
                                GALGAS_constantDefinitionList &  parameter_8,
                                GALGAS_checkpicList &  parameter_9,
                                GALGAS_dataList &  parameter_10,
                                GALGAS_bool &  parameter_11,
                                GALGAS_bool &  parameter_12,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 0 :
      rule_pic_31__38__5F_syntax_body_i0_(parameter_1, parameter_2, parameter_3, parameter_4, parameter_5, parameter_6, parameter_7, parameter_8, parameter_9, parameter_10, parameter_11, parameter_12, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//                   Grammar start symbol implementation                     *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::_performSourceFileParsing_ (C_Compiler * inCompiler,
                                GALGAS_lstring inFilePath,
                                GALGAS_pic_31__38_InterruptDefinitionList &  parameter_1,
                                GALGAS_pic_31__38_RoutineDefinitionList &  parameter_2,
                                GALGAS_lstringlist &  parameter_3,
                                GALGAS_lstringlist &  parameter_4,
                                GALGAS_ramDefinitionList &  parameter_5,
                                GALGAS_lstringlist &  parameter_6,
                                GALGAS_configDefinitionList &  parameter_7,
                                GALGAS_constantDefinitionList &  parameter_8,
                                GALGAS_checkpicList &  parameter_9,
                                GALGAS_dataList &  parameter_10,
                                GALGAS_bool &  parameter_11,
                                GALGAS_bool &  parameter_12
                                COMMA_LOCATION_ARGS) {
  if (inFilePath.isValid ()) {
    const GALGAS_string filePathAsString = inFilePath.reader_string (HERE) ;
    C_String filePath = filePathAsString.stringValue () ;
    if (! C_FileManager::isAbsolutePath (filePath)) {
      filePath = inCompiler->sourceFilePath ().stringByDeletingLastPathComponent ().stringByAppendingPathComponent (filePath) ;
    }
    if (C_FileManager::fileExistsAtPath (filePath)) {
      C_Lexique_piccolo_5F_lexique * scanner = NULL ;
      macroMyNew (scanner, C_Lexique_piccolo_5F_lexique (inCompiler, "", "", filePath COMMA_HERE)) ;
      if (scanner->sourceText () != NULL) {
        const bool ok = scanner->performBottomUpParsing (gActionTable, gNonTerminalNames,
                                                         gActionTableIndex, gSuccessorTable,
                                                         gProductionsTable) ;
        if (ok && ! executionModeIsSyntaxAnalysisOnly ()) {
          cGrammar_pic_31__38__5F_include_5F_grammar grammar ;
          grammar.nt_body_ (parameter_1, parameter_2, parameter_3, parameter_4, parameter_5, parameter_6, parameter_7, parameter_8, parameter_9, parameter_10, parameter_11, parameter_12, scanner) ;
        }
      }else{
        C_String message ;
        message << "the '" << filePath << "' file exists, but cannot be read" ;
        const GALGAS_location errorLocation (inFilePath.reader_location (THERE)) ;
        inCompiler->semanticErrorAtLocation (errorLocation, message COMMA_THERE) ;
    }
    macroDetachSharedObject (scanner) ;
  }else{
    C_String message ;
    message << "the '" << filePath << "' file does not exist" ;
    const GALGAS_location errorLocation (inFilePath.reader_location (THERE)) ;
    inCompiler->semanticErrorAtLocation (errorLocation, message COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::_performSourceStringParsing_ (C_Compiler * inCompiler,
                                GALGAS_string inSourceString,
                                GALGAS_pic_31__38_InterruptDefinitionList &  parameter_1,
                                GALGAS_pic_31__38_RoutineDefinitionList &  parameter_2,
                                GALGAS_lstringlist &  parameter_3,
                                GALGAS_lstringlist &  parameter_4,
                                GALGAS_ramDefinitionList &  parameter_5,
                                GALGAS_lstringlist &  parameter_6,
                                GALGAS_configDefinitionList &  parameter_7,
                                GALGAS_constantDefinitionList &  parameter_8,
                                GALGAS_checkpicList &  parameter_9,
                                GALGAS_dataList &  parameter_10,
                                GALGAS_bool &  parameter_11,
                                GALGAS_bool &  parameter_12
                                COMMA_UNUSED_LOCATION_ARGS) {
  C_Lexique_piccolo_5F_lexique * scanner = NULL ;
  macroMyNew (scanner, C_Lexique_piccolo_5F_lexique (inCompiler, inSourceString.stringValue (), "" COMMA_HERE)) ;
  if (scanner->sourceText () != NULL) {
    const bool ok = scanner->performBottomUpParsing (gActionTable, gNonTerminalNames,
                                                     gActionTableIndex, gSuccessorTable,
                                                     gProductionsTable) ;
    if (ok && ! executionModeIsSyntaxAnalysisOnly ()) {
      cGrammar_pic_31__38__5F_include_5F_grammar _grammar ;
      _grammar.nt_body_ (parameter_1, parameter_2, parameter_3, parameter_4, parameter_5, parameter_6, parameter_7, parameter_8, parameter_9, parameter_10, parameter_11, parameter_12, scanner) ;
    }
  }
  macroDetachSharedObject (scanner) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//            'checkpic_definition' non terminal implementation              *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_checkpic_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 1 :
      rule_pic_31__38__5F_syntax_checkpic_5F_definition_i1_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_checkpic_5F_definition_ (GALGAS_checkpicList &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 1 :
      rule_pic_31__38__5F_syntax_checkpic_5F_definition_i1_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'data_definition' non terminal implementation                *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_data_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 2 :
      rule_pic_31__38__5F_syntax_data_5F_definition_i2_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_data_5F_definition_ (GALGAS_dataList &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 2 :
      rule_pic_31__38__5F_syntax_data_5F_definition_i2_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'instruction_list' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_instruction_5F_list_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 3 :
      rule_pic_31__38__5F_syntax_instruction_5F_list_i3_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_instruction_5F_list_ (GALGAS_pic_31__38_InstructionList &  parameter_1,
                                GALGAS_bool &  parameter_2,
                                GALGAS_bool &  parameter_3,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 3 :
      rule_pic_31__38__5F_syntax_instruction_5F_list_i3_(parameter_1, parameter_2, parameter_3, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//            'interrupt_definition' non terminal implementation             *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_interrupt_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 4 :
      rule_pic_31__38__5F_syntax_interrupt_5F_definition_i4_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

