pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
void cGrammar_pic_31__38__5F_include_5F_grammar::nt_interrupt_5F_definition_ (GALGAS_pic_31__38_InterruptDefinitionList &  parameter_1,
                                GALGAS_bool &  parameter_2,
                                GALGAS_bool &  parameter_3,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 4 :
      rule_pic_31__38__5F_syntax_interrupt_5F_definition_i4_(parameter_1, parameter_2, parameter_3, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'routine_definition' non terminal implementation              *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_routine_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 5 :
      rule_pic_31__38__5F_syntax_routine_5F_definition_i5_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_routine_5F_definition_ (GALGAS_pic_31__38_RoutineDefinitionList &  parameter_1,
                                GALGAS_bool &  parameter_2,
                                GALGAS_bool &  parameter_3,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 5 :
      rule_pic_31__38__5F_syntax_routine_5F_definition_i5_(parameter_1, parameter_2, parameter_3, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'condition_factor' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_condition_5F_factor_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 6 :
      rule_pic_31__38__5F_syntax_condition_5F_factor_i6_parse(inLexique) ;
    break ;
  case 7 :
      rule_pic_31__38__5F_syntax_condition_5F_factor_i7_parse(inLexique) ;
    break ;
  case 8 :
      rule_pic_31__38__5F_syntax_condition_5F_factor_i8_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_condition_5F_factor_ (GALGAS_pic_31__38_ConditionExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 6 :
      rule_pic_31__38__5F_syntax_condition_5F_factor_i6_(parameter_1, inLexique) ;
    break ;
  case 7 :
      rule_pic_31__38__5F_syntax_condition_5F_factor_i7_(parameter_1, inLexique) ;
    break ;
  case 8 :
      rule_pic_31__38__5F_syntax_condition_5F_factor_i8_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//            'condition_expression' non terminal implementation             *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_condition_5F_expression_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 9 :
      rule_pic_31__38__5F_syntax_condition_5F_expression_i9_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_condition_5F_expression_ (GALGAS_pic_31__38_ConditionExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 9 :
      rule_pic_31__38__5F_syntax_condition_5F_expression_i9_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//               'condition_term' non terminal implementation                *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_condition_5F_term_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 10 :
      rule_pic_31__38__5F_syntax_condition_5F_term_i10_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_condition_5F_term_ (GALGAS_pic_31__38_ConditionExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 10 :
      rule_pic_31__38__5F_syntax_condition_5F_term_i10_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'block_termination' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_block_5F_termination_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 11 :
      rule_pic_31__38__5F_syntax_block_5F_termination_i11_parse(inLexique) ;
    break ;
  case 12 :
      rule_pic_31__38__5F_syntax_block_5F_termination_i12_parse(inLexique) ;
    break ;
  case 13 :
      rule_pic_31__38__5F_syntax_block_5F_termination_i13_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_block_5F_termination_ (GALGAS_abstractBlockTerminationForBlockInstruction &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 11 :
      rule_pic_31__38__5F_syntax_block_5F_termination_i11_(parameter_1, inLexique) ;
    break ;
  case 12 :
      rule_pic_31__38__5F_syntax_block_5F_termination_i12_(parameter_1, inLexique) ;
    break ;
  case 13 :
      rule_pic_31__38__5F_syntax_block_5F_termination_i13_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//           'structured_instruction' non terminal implementation            *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_structured_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 14 :
      rule_pic_31__38__5F_syntax_structured_5F_instruction_i14_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_structured_5F_instruction_ (GALGAS_pic_31__38_PiccoloInstruction &  parameter_1,
                                GALGAS_bool &  parameter_2,
                                GALGAS_bool &  parameter_3,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 14 :
      rule_pic_31__38__5F_syntax_structured_5F_instruction_i14_(parameter_1, parameter_2, parameter_3, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//         'structured_if_instruction' non terminal implementation           *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_structured_5F_if_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 15 :
      rule_pic_31__38__5F_syntax_structured_5F_if_5F_instruction_i15_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

