pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
void cGrammar_pic_31__38__5F_include_5F_grammar::nt_immediate_5F_term_ (GALGAS_immediatExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 24 :
      rule_communs_immediate_5F_term_i7_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'immediate_factor' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_immediate_5F_factor_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 25 :
      rule_communs_immediate_5F_factor_i8_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_immediate_5F_factor_ (GALGAS_immediatExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 25 :
      rule_communs_immediate_5F_factor_i8_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'immediate_primary' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_immediate_5F_primary_parse (C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 26 :
      rule_communs_immediate_5F_primary_i9_parse(inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
    break ;
  }
}

void cGrammar_pic_31__38__5F_include_5F_grammar::nt_immediate_5F_primary_ (GALGAS_immediatExpression &  parameter_1,
                                C_Lexique_piccolo_5F_lexique * inLexique) {
  switch (inLexique->nextProductionIndex ()) {
  case 26 :
      rule_communs_immediate_5F_primary_i9_(parameter_1, inLexique) ;
    break ;
  default :
    inLexique->internalBottomUpParserError (HERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_0' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_0 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 31 32 33 34 35 36 37 38 39 40 41 42 43
  return inLexique->nextProductionIndex () - 30 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_1' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_1 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 44 45
  return inLexique->nextProductionIndex () - 43 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_2' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_2 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 46 47
  return inLexique->nextProductionIndex () - 45 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_3' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_3 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 48 49
  return inLexique->nextProductionIndex () - 47 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_4' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_4 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 50 51
  return inLexique->nextProductionIndex () - 49 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_5' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

