pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_5 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 52 53
  return inLexique->nextProductionIndex () - 51 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_6' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_6 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 54 55 56
  return inLexique->nextProductionIndex () - 53 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_7' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_7 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 57 58
  return inLexique->nextProductionIndex () - 56 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_8' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_8 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 59 60
  return inLexique->nextProductionIndex () - 58 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//       'select_pic_31__38__5F_syntax_9' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_9 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 61 62
  return inLexique->nextProductionIndex () - 60 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_10' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_10 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 63 64 65
  return inLexique->nextProductionIndex () - 62 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_11' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_11 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 66 67
  return inLexique->nextProductionIndex () - 65 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_12' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_12 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 68 69 70 71 72
  return inLexique->nextProductionIndex () - 67 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_13' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_13 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 73 74
  return inLexique->nextProductionIndex () - 72 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_14' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_14 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 75 76
  return inLexique->nextProductionIndex () - 74 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_15' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_15 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 77 78 79 80 81 82
  return inLexique->nextProductionIndex () - 76 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_16' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_16 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 83 84
  return inLexique->nextProductionIndex () - 82 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_17' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

