pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_17 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 85 86
  return inLexique->nextProductionIndex () - 84 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_18' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_18 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 87 88
  return inLexique->nextProductionIndex () - 86 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_19' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_19 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111
  return inLexique->nextProductionIndex () - 88 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_20' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_20 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 112 113
  return inLexique->nextProductionIndex () - 111 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_21' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_21 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 114 115
  return inLexique->nextProductionIndex () - 113 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_22' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_22 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 116 117
  return inLexique->nextProductionIndex () - 115 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_23' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_23 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 118 119 120 121
  return inLexique->nextProductionIndex () - 117 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_24' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_24 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 122 123
  return inLexique->nextProductionIndex () - 121 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_25' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_25 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 124 125
  return inLexique->nextProductionIndex () - 123 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_26' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_26 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 126 127
  return inLexique->nextProductionIndex () - 125 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_27' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_27 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 128 129
  return inLexique->nextProductionIndex () - 127 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_28' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_28 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 130 131 132 133
  return inLexique->nextProductionIndex () - 129 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_29' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_29 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 134 135
  return inLexique->nextProductionIndex () - 133 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_30' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_30 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 136 137
  return inLexique->nextProductionIndex () - 135 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_31' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_31 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 138 139
  return inLexique->nextProductionIndex () - 137 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_32' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

