pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_32 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 140 141
  return inLexique->nextProductionIndex () - 139 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_33' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_33 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 142 143
  return inLexique->nextProductionIndex () - 141 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_34' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_34 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 144 145 146 147 148 149 150 151
  return inLexique->nextProductionIndex () - 143 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_35' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_35 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 152 153 154
  return inLexique->nextProductionIndex () - 151 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_36' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_36 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172
  return inLexique->nextProductionIndex () - 154 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_37' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_37 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189
  return inLexique->nextProductionIndex () - 172 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_38' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_38 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 190 191 192 193 194
  return inLexique->nextProductionIndex () - 189 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_39' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_39 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 195 196 197
  return inLexique->nextProductionIndex () - 194 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_40' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_40 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 198 199 200 201 202 203 204
  return inLexique->nextProductionIndex () - 197 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_41' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_41 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 205 206 207 208
  return inLexique->nextProductionIndex () - 204 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      'select_pic_31__38__5F_syntax_42' non terminal implementation        *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_pic_31__38__5F_syntax_42 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 209 210 211 212
  return inLexique->nextProductionIndex () - 208 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_0' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_0 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 213 214
  return inLexique->nextProductionIndex () - 212 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_1' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_1 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 215 216
  return inLexique->nextProductionIndex () - 214 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_2' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_2 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 217 218
  return inLexique->nextProductionIndex () - 216 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_3' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

