pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_include_grammar.cpp
PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_3 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 219 220
  return inLexique->nextProductionIndex () - 218 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_4' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_4 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 221 222
  return inLexique->nextProductionIndex () - 220 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_5' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_5 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 223 224
  return inLexique->nextProductionIndex () - 222 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_6' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_6 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 225 226
  return inLexique->nextProductionIndex () - 224 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_7' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_7 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 227 228
  return inLexique->nextProductionIndex () - 226 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_8' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_8 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 229 230
  return inLexique->nextProductionIndex () - 228 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              'select_communs_9' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_9 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 231 232 233
  return inLexique->nextProductionIndex () - 230 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_10' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_10 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 234 235
  return inLexique->nextProductionIndex () - 233 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_11' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_11 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 236 237 238 239 240 241 242
  return inLexique->nextProductionIndex () - 235 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_12' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_12 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 243 244 245 246 247
  return inLexique->nextProductionIndex () - 242 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_13' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_13 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 248 249 250 251
  return inLexique->nextProductionIndex () - 247 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_14' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_14 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 252 253 254 255 256 257 258
  return inLexique->nextProductionIndex () - 251 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_15' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_15 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 259 260
  return inLexique->nextProductionIndex () - 258 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_16' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_16 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 261 262
  return inLexique->nextProductionIndex () - 260 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_17' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_17 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 263 264
  return inLexique->nextProductionIndex () - 262 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_18' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_18 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 265 266
  return inLexique->nextProductionIndex () - 264 ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             'select_communs_19' non terminal implementation               *
//                                                                           *
//---------------------------------------------------------------------------*

PMSInt32 cGrammar_pic_31__38__5F_include_5F_grammar::select_communs_19 (C_Lexique_piccolo_5F_lexique * inLexique) {
// Productions numbers : 267 268
  return inLexique->nextProductionIndex () - 266 ;
}

//---------------------------------------------------------------------------*

